Revit 2026 API

# ViewScheduleExportOptions Class

---

The export options used to export schedule views.

SystemObject Autodesk.Revit.DBViewScheduleExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewScheduleExportOptions : IDisposable
```
```vb
Public Class ViewScheduleExportOptions
	Implements IDisposable
```
```cpp
public ref class ViewScheduleExportOptions : IDisposable
```
```fsharp
type ViewScheduleExportOptions =
    class
        interface IDisposable
    end
```

The ViewScheduleExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewScheduleExportOptions | Constructs a new instance of the ViewScheduleExportOptions class |
|  | ViewScheduleExportOptions(ViewScheduleExportOptions) | Constructs a new copy of the input ViewScheduleExportOptions object. |

|  | Name | Description |
| --- | --- | --- |
|  | ColumnHeaders | How to export column headers. Default is MultipleRows. |
|  | FieldDelimiter | How to delimit fields. Default is Tab. |
|  | HeadersFootersBlanks | Whether to export group headers, footers, and blank lines. Default is true. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TextQualifier | How to qualify text fields. Default is DoubleQuote. |
|  | Title | Whether or not to export the schedule title. Default is true. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ViewScheduleExportOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace